0/D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      D;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0.0 0 0);

boundaryField

{
	top{
type zeroGradient;
	}

	bottom{
type zeroGradient;
	}
	
	right{
type zeroGradient;
	}
	
	left{
type zeroGradient;
	}
	
	frontAndBack{
type zeroGradient;
	}
}}


// ************************************************************************* //
