0/Temperature
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.0;

boundaryField
{
	top{
type zeroGradient;
	}

	bottom{
type zeroGradient;
	}
	
	right{
type zeroGradient;
	}
	
	left{
type zeroGradient;;
	}
	
	frontAndBack{
type zeroGradient;
	}
}

/*
{
	top{
type fixedValue;
value uniform 300;
	}

	bottom{
type fixedValue;
value uniform 300;
	}
	
	right{
type fixedValue;
value uniform 300;
	}
	
	left{
type fixedValue;
value uniform 300;
	}
	
	frontAndBack{
type fixedValue;
value uniform 300;
	}
}
*/
// ************************************************************************* //
