0/gradTSol
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 1 0 0 0];

internalField   uniform (0.0 0 0);

boundaryField
{
	top{
type fixedValue;
value           uniform (0 0 0);
	}

	bottom{
type fixedValue;
value           uniform (0 0 0);
	}
	
	right{
type fixedValue;
value           uniform (0 0 0);
	}
	
	left{
type fixedValue;
value           uniform (0 0 0);
	}
	
	frontAndBack{
type fixedValue;
value           uniform (0 0 0);
	}
}


// ************************************************************************* //
