constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1925;
        startFace       140200;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1925;
        startFace       142125;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          875;
        startFace       144050;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          875;
        startFace       144925;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2750;
        startFace       145800;
    }
)

// ************************************************************************* //
